<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
	<head>
		<title>TIPP10 Bedienungsanleitung</title>
		<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body style="background-color: rgb(255, 255, 255);" bgcolor="#FFFFFF" marginheight="0" marginwidth="0" leftmargin="10" topmargin="10">
	  <div class="container">
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="introduction.html">Einf&uuml;hrung</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="installation.html">Installation</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="headline1">
			2. Merkmale von TIPP10
		</p>
		<a name="properties"></a>
		<p class="headline2">
			2.1 Programmeigenschaften
		</p>
		<p class="standard">
			<b>2.1.1 Intelligente &Uuml;bungslektionen</b><br>
			&nbsp;<br>
			Die Texte der Lektionen reagieren individuell auf Ihre Tippfehler. H&auml;ufig falsch getippte Buchstaben werden sofort intensiver wiederholt als richtig getippte Zeichen. Dieses System erm&ouml;glicht Ihnen, Tippfehler schnell in den Griff zu bekommen und das Zehnfingersystem effizient und fehlerfrei zu erlernen. Zudem verspricht es Ihnen Abwechslung, da kein Diktat dem anderen gleicht.<br>
			20 aufeinander aufbauende &Uuml;bungslektionen gew&ouml;hnen Sie schrittweise an alle Tasten der Tastatur. Im Sprachgebrauch h&auml;ufig verwendete Schriftzeichen erlernen Sie dabei fr&uuml;her und h&auml;ufiger, als selten verwendete Schriftzeichen.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>2.1.2 Laufschrift und virtuelle Hilfetastatur</b><br>
			&nbsp;<br>
			Ein in der Schriftart, der Geschwindigkeit und farblich einstellbares Laufband erm&ouml;glicht Ihnen kontinuierlichen Schreibfluss. Farbig angezeigte Tasten und Tastwege auf einer virtuellen Tastatur unterst&uuml;tzen Sie bei der korrekten Benutzung der verschiedenen Finger und der Einhaltung der Grundstellung. Zus&auml;tzlich werden die zu verwendenden Finger in einer Statusleiste erkl&auml;rt und Informationen &uuml;ber Fehlerzahl und Anschl&auml;ge pro Minute angezeigt.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>2.1.3 Lernstatistik</b><br>
			&nbsp;<br>
			Nach jedem Schreibtraining erhalten Sie einen ausf&uuml;hrlichen und druckbaren Bericht, der die absolvierte Lektion bewertet. Eine Auflistung aller vollzogenen Lektionen mit Informationen &uuml;ber Dauer, Fehlerzahl, Anschl&auml;ge pro Minute und einer Bewertung gibt Ihnen Auskunft &uuml;ber Ihre vollbrachten Leistungen. Ein Verlaufsdiagramm der Lektionen zeigt Ihren Fortschritt und l&auml;sst Sie Ihre Leistungen individuell vergleichen. Zus&auml;tzlich zeigt Ihnen TIPP10 die Fehlerquoten aller im Schreibtraining verwendeten Schriftzeichen und Finger an. So sehen Sie sofort, welche Zeichen und Finger Ihnen noch Schwierigkeiten bereiten.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>2.1.4 Freie und eigene Lektionen</b><br>
			&nbsp;<br>
			Wenn Sie das Zehnfingersystem schon etwas beherrschen und sich vor allem in Punkto Fehlerquote und Schreibgeschwindigkeit verbessern wollen, k&ouml;nnen Sie auch freie und eigene Lektionen absolvieren. Freie Lektionen bieten Diktate zu bestimmten Themen. Auf diese Weise lassen sich gezielt bestimmte Texteigenschaften trainieren, wie sie z.B. beim Programmieren oder in Gesetzestexten vorkommen. Eigene Lektionen dienen dagegen dazu, selbst erstellten Text in den Schreibtrainer TIPP10 zu laden, um sich diesen anschlie&szlig;end diktieren zu lassen.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>2.1.5 Umfangreiche Anpassungsm&ouml;glichkeiten</b><br>
			&nbsp;<br>
			Sie k&ouml;nnen selbst festlegen, wie eine Lektion gesteuert wird. So l&auml;sst sich die Dauer der Lektion individuell festlegen, das Verhalten des Schreibtrainers auf Tippfehler bestimmen und welche visuellen Hilfestellungen Sie bei dem Schreibtraining unterst&uuml;tzen sollen. In den Grundeinstellungen der Software lassen sich zudem weitere Anpassungen vornehmen, falls Sie beispielsweise eine andere Geschwindigkeit des Laufbands oder eine gr&ouml;&szlig;ere Schrift bevorzugen.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>2.1.6 Plattformunabh&auml;ngig und mehrsprachig</b><br>
			&nbsp;<br>
			TIPP10 ist f&uuml;r die Betriebsysteme Windows, Mac OS X und diverse Linuxdistributionen verf&uuml;gbar. Die Software wird derzeit in den Sprachen Deutsch und Englisch angeboten, au&szlig;erdem k&ouml;nnen Sie zwischen verschiedenen Tastaturlayouts w&auml;hlen. Neben dem deutschen Tastaturlayout, kann auch das Layout der Schweiz, das Layout der USA oder die alternativen Tastaturlayouts <i>NEO</i>, <i>Dvorak</i> und <i>RISTOME</i> aktiviert werden. Die Sprache der Programmoberfl&auml;che, die Sprache der Lektionen und das Tastaturlayout k&ouml;nnen getrennt voneinander eingestellt werden.<br>
			&nbsp;
		</p>
		<a name="requirements"></a>
		<p class="headline2">
			2.2 Systemanforderungen
		</p>
		<p class="standard">
			Um TIPP10 verwenden zu k&ouml;nnen, ben&ouml;tigen Sie einen herk&ouml;mmlichen Computer mit einem Windows-, Macintosh- oder Linux-Betriebsystem.<br>
			Unterst&uuml;tzt werden<br>
			- Windows 98, 2000, XP, Vista und 7<br>
			- Mac OS X Version 10.3.x oder h&ouml;her (PPC- oder Intelprozessor)<br>
			- diverse Linux-Distributionen (Ubuntu, Kubuntu, OpenSuse, Puppy, Redhat, u.a.)<br>
			Da die dynamische Erstellung der Lektionen zur Laufzeit zus&auml;tzliche Rechenzeit ben&ouml;tigt, sollte der Computer &uuml;ber ausreichend Arbeitsspeicher (mindestens 64 MB) und Prozessorleistung (mindestens 800 Mhz) verf&uuml;gen. Zudem sollte Ihre Grafikkarte und Ihr Monitor mindestens 16 Millionen Farben (16 Bit) und eine Aufl&ouml;sung von mindestens 800x600 Pixel darstellen k&ouml;nnen.<br>
			&nbsp;
		</p>
		<a name="database"></a>
		<p class="headline2">
			2.3 Benutzer und ihre Daten
		</p>
		<p class="standard">
			<a name="database_introduction"></a>
			<b>2.3.1 Vorwort</b><br>
			&nbsp;<br>
			Das Thema Benutzerverwaltung wird von den TIPP10-Benutzern immer wieder angesprochen. Version 1 speicherte die Daten des Benutzers noch in einer Datenbank (<i>tipp10.db</i>), die sich im Programmverzeichnis von TIPP10 befand. Dies hatte den Nachteil, dass TIPP10 eigentlich nur von einer Person pro Computer benutzt werden konnte. Es wurde immer die gleiche Datenbank verwendet, obwohl Lektionen, Fehlerquoten und somit die Anpassung des Diktats pro Benutzer anders ausfallen. Zudem machte diese Art der Verwaltung auch Probleme, wenn TIPP10 im Netzwerk eingesetzt wurde, da oftmals keine Schreibrechte f&uuml;r das Programmverzeichnis vorhanden waren.<br>
			&nbsp;<br>
			Daher wurde zuerst die M&ouml;glichkeit in Betracht gezogen, eine einfache und anwenderfreundliche Benutzerverwaltung mit Anmeldung zu integrieren. Leider entstehen durch eine Anmeldung zahlreiche weitere Anforderungen an die Software. So muss eine Benutzerverwaltung existieren, mit der einzelne Benutzer ge&auml;ndert und gel&ouml;scht werden k&ouml;nnen, zudem wird die Weiterentwicklung und Aktualisierungsm&ouml;glichkeit von Software und Datenbank durch die Benutzerf&uuml;hrung deutlich erschwert.<br>
			&nbsp;<br>
			TIPP10 soll ein schlichtes und einfach zu bedienendes Programm bleiben. Da der Gro&szlig;teil aller Benutzer von TIPP10 nur mit einem Account pro Computer arbeitet, wurde seit Version 2.0 zu folgenden Alternativen gegriffen, um die Datenbank zu handhaben:<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="database_handling"></a>
			<b>2.3.2 Portable Version (Windows)</b><br>
			&nbsp;<br>
			Die portable Version von TIPP10 speichert die Daten direkt im Programmverzeichnis ab und kann daher immer nur von einer Person verwendet werden. Daf&uuml;r bietet Sie aber den Vorteil der portablen Nutzung und kann so ohne Datenverlust z.B. mit Hilfe eines USB-Sticks auf verschiedenen Computern gestartet werden.<br>
			&nbsp;<br>
			Die Datenbank <i>tipp10v2.db</i> mit den Benutzerdaten und die Datei <i>settings.ini</i> mit den gew&auml;hlten Programmeinstellungen ist bei der portablen Version unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			Programmverzeichnis\portable\
		</p>
		<p class="standard">
			Das Verzeichnis <i>portable</i> wird beim ersten Programmstart automatisch erzeugt.<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="database_handling"></a>
			<b>2.3.3 Installierbare Version (Windows, Mac OS, Linux)</b><br>
			&nbsp;<br>
			Die installierbare Version von TIPP10 erzeugt beim ersten Programmstart eine neue Datenbank <i>tipp10v2.db</i> im <i>HOME</i>-Verzeichnis des Benutzers.<br>
			&nbsp;<br>
			Bei Windows ist das Verzeichnis normalerweise unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			C:\Dokumente und Einstellungen\<i>Benutzername</i>\Anwendungsdaten\TIPP10\
		</p>
		<p class="standard">
			Bei MacOS ist das Verzeichnis normalerweise unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			/Users/<i>Benutzername</i>/Library/Application Support/TIPP10/
		</p>
		<p class="standard">
			Bei Linux ist das Verzeichnis normalerweise unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			/home/<i>Benutzername</i>/TIPP10/
		</p>
		<p class="standard">
			Im Ordner <i>TIPP10</i> liegt dann die Datenbank <i>tipp10v2.db</i>. Anschlie&szlig;end kann bei Bedarf der Pfad zur Datenbank in den Grundeinstellungen von TIPP10 angepasst werden.<br>
			&nbsp;<br>
			Die Vorteile dieser Art der Datenbankverwaltung:<br>
			1. Der "normale" TIPP10-Nutzer mit einem eigenen Computer und einem Account kann TIPP10 wie gewohnt nutzen, zudem kann er den Speicherort der Datenbank (z.B. f&uuml;r Datensicherungen) individuell festlegen.<br>
			2. Schulen oder andere Institutionen mit vielen Benutzeraccounts pro Computer, jedoch ohne zentralen Dateiserver, k&ouml;nnen TIPP10 gemeinsam nutzen. F&uuml;r jeden Benutzer, der das Programm aufruft, wird automatisch eine individuelle Datenbank im jeweiligen <i>HOME</i>-Verzeichnis angelegt.<br>
			3. Die Nutzung von TIPP10 im Netzwerk ist auch ohne Probleme m&ouml;glich. Das ausf&uuml;hrbare Programm wird vom Dateiserver zur Verf&uuml;gung gestellt, die Datenbank aber auf dem Client erzeugt und verwendet. Auf diese Weise bestehen Schreibrechte auf die Datenbank und der relativ hohe Datentransfer zur Datenbank (bedingt durch die Intelligenzfunktion) kann vollst&auml;ndig vom Client &uuml;bernommen werden.<br>
			&nbsp;<br>
			Leider wird aber durch diese Art der Datenbankverwaltung eine Benutzer-Klientel ausgesperrt, und zwar mehrere Personen die einen Computer mit nur einem Benutzeraccount verwenden. Aber auch hierf&uuml;r gibt es eine L&ouml;sung:<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="database_handling"></a>
			<b>2.3.4 Parameter&uuml;bergabe des Datenbankpfads</b><br>
			&nbsp;<br>
			TIPP10 kann mit Hilfe eines Parameters aufgerufen werden, der dem Programm einen aktuellen Datenbankpfad &uuml;bermittelt. So ist es m&ouml;glich, f&uuml;r jeden Benutzer eine Programmverkn&uuml;pfung mit eigenem Datenbankpfad anzulegen.<br>
			&nbsp;<br>
			Unter Windows sollten Sie dazu eine neue Verkn&uuml;pfung zu der Datei <i>tipp10.exe</i> erstellen. In den Eigenschaften der Verkn&uuml;pfung k&ouml;nnen Sie dann den Pfad als Programmparameter eingeben.<br>
			&nbsp;<br>
			<img src="../img/h_program_shortcut.png" width="220" height="305" border="0"><br>
			&nbsp;<br>
			Beispieleingabe unter Windows:
		</p>
		<p class="code">
			"C:\Programme\TIPP10\tipp10.exe" "C:/tipp10/user1"
		</p>
		<p class="standard">
			Beachten Sie dabei unbedingt:<br>
			1. Befehl und Parameter sollten in Anf&uuml;hrungszeichen gefasst werden<br>
			2. der Pfad wird mit normalen Schr&auml;gstrichen (Slash: /) angegeben<br>
			3. der Pfad gibt das Verzeichnis zur Datenbank an und nicht die Datenbank-Datei selbst<br>
			4. der Pfad endet ohne Schr&auml;gstrich (Slash)<br>
			&nbsp;<br>
			&nbsp;<br>
			Unter MacOS geben Sie den Parameter hinter den Programmaufruf &uuml;ber das Terminal ein, also z.B.:
		</p>
		<p class="code">
			./tipp10 "/tipp10/user1"
		</p>
		<p class="standard">
			<img src="../img/h_terminal_mac.png" width="520" height="183" border="0"><br>
			&nbsp;<br>
			&nbsp;<br>
			Auch unter Linux geben Sie den Parameter einfach hinter den Programmaufruf in das Terminal ein, also z.B.:
		</p>
		<p class="code">
			./tipp10 "/tipp10/user1"
		</p>
		<p class="standard">
			&nbsp;<br>
			In dem Verzeichnis <i>user1</i> wird beim ersten Programmaufruf &uuml;ber die Verkn&uuml;pfung automatisch eine neue Datenbank erzeugt. Beachten Sie aber unbedingt, dass das Verzeichnis bereits existieren muss!<br>
			&nbsp;
		</p>
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="introduction.html">Einf&uuml;hrung</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="installation.html">Installation</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="small">
			&copy; 2006-2011 Tom Thielicke IT Solutions
		</p>
	  </div>
	</body>
</html>