<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
	<head>
		<title>TIPP10 Bedienungsanleitung</title>
		<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body style="background-color: rgb(255, 255, 255);" bgcolor="#FFFFFF" marginheight="0" marginwidth="0" leftmargin="10" topmargin="10">
	  <div class="container">
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="features.html">Merkmale von TIPP10</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="behaviour.html">Ergonomie am Arbeitsplatz</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="headline1">
			3. Installation
		</p>
		<p class="standard">
			TIPP10 k&ouml;nnen Sie kostenlos aus dem Internet herunterladen. Geben Sie dazu die Internetadresse <a href="http://www.tipp10.com" target="_blank">http://www.tipp10.com</a> in einen Browser ein, w&auml;hlen anschlie&szlig;end unter dem Men&uuml;punkt <i>Download</i> die f&uuml;r Ihren Computer passende Version von TIPP10 und speichern die Datei auf Ihrem Computer.<br>
			&nbsp;
		</p>
		<a name="update"></a>
		<p class="headline2">
			3.1 Update
		</p>
		<p class="standard">
			Sollten Sie TIPP10 bereits besitzen, k&ouml;nnen Sie auf die aktuelle Programmversion umsteigen ohne Ihre gespeicherten Daten zu verlieren.<br>
			Installieren Sie dazu TIPP10 einfach &uuml;ber die existierende Version ohne sie vorher zu deinstallieren. Ihre bisherigen Daten bleiben erhalten und Ihre Datenbank wird beim ersten Programmstart auf den neuesten Stand gebracht.<br>
			Bei der portablen Windowsversion m&uuml;ssen Sie darauf achten, dass der Ordner <i>portable</i> innerhalb des TIPP10-Verzeichnisses erhalten bleibt. Sie erreichen dies, indem Sie den Ordner <i>portable</i> der alten Version in das Verzeichnis der neuen Version kopieren.<br>
			&nbsp;
		</p>
		<a name="windows"></a>
		<p class="headline2">
			3.2 Installation unter Windows
		</p>
		<p class="standard">
			TIPP10 f&uuml;r Windows gibt es in zwei Ausf&uuml;hrungen. Als installierbare Version und als portable Version. Die installierbare Version besitzt eine Installationsroutine, kann also nach der Installation &uuml;ber das Startmen&uuml; gestartet werden und legt f&uuml;r jeden Windowsbenutzer eine eigene Datenbank an. Sie kann au&szlig;erdem im Netzwerk verwendet werden. Die portable Version dagegen ist geeignet, um sie z.B. von einem USB-Stick zu starten. Sie mu&szlig; nicht installiert werden, ist aber auch nur f&uuml;r einen Benutzer geeignet (da die Daten direkt im Programmverzeichnis gespeichert werden).<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="windows_install"></a>
			<b>3.2.1 Installierbare Version</b><br>
			&nbsp;<br>
			Um das Programm TIPP10 unter Windows zu installieren, starten Sie die Datei <i>tipp10_win_2-1-0.exe</i> indem Sie einen Doppelklick auf das Dateisymbol ausf&uuml;hren. Anschlie&szlig;end wird ein Installationsprogramm gestartet.<br>
			&nbsp;<br>
			Zun&auml;chst k&ouml;nnen Sie die Sprache w&auml;hlen, die f&uuml;r die Installation verwendet wird. Diese Einstellung hat keine Auswirkung auf die Sprache, die sp&auml;ter im Programm selbst verwendet wird. Best&auml;tigen Sie Ihre Wahl, indem Sie auf den Button <i>OK</i> klicken.<br>
			&nbsp;<br>
			<img src="../img/h_installer_win.png" width="220" height="171" border="0"><br>
			&nbsp;<br>
			Nach einem Klick auf <i>Weiter</i> werden Sie im n&auml;chsten Schritt gebeten, die Lizenzvereinbarung zu akzeptieren. Lesen Sie sich die Vereinbarung sorgf&auml;ltig durch. Erst nachdem Sie diese akzeptiert haben, k&ouml;nnen Sie die Installation mit einem Klick auf den Button <i>Weiter</i> fortsetzen.<br>
			&nbsp;<br>
			Nun werden Sie aufgefordert, ein Verzeichnis anzugeben, in dem TIPP10 installiert werden soll. Im Normalfall sind hier keine Modifizierungen n&ouml;tig, Sie k&ouml;nnen aber bei Bedarf ein eigenes Verzeichnis angeben oder durch Klick auf <i>Durchsuchen</i> direkt ausw&auml;hlen.<br>
			&nbsp;<br>
			Nach einem Klick auf <i>Weiter</i> werden Sie gefragt, welchen Namen der Ordner in Ihrem Windows-Startmen&uuml; tragen soll. Auch hier k&ouml;nnen Sie bei Bedarf einen eigenen Namen festlegen. Anschlie&szlig;end k&ouml;nnen Sie die Installation &uuml;ber den Button <i>Weiter</i> fortf&uuml;hren.
			&nbsp;<br>
			In einem vorletzten Schritt vor dem eigentlichen Installieren der Dateien, werden Sie noch gefragt, ob eine Programmverkn&uuml;pfung auf Ihrem Desktop angelegt werden soll. Wenn Sie dies w&uuml;nschen, versehen Sie <i>Desktop-Symbol</i> &uuml;ber einen Mausklick mit einem Haken. Andernfalls kann das Programm nach der Installation nur &uuml;ber das Windows-Startmen&uuml; gestartet werden. Best&auml;tigen Sie Ihre Wahl nun wieder mit einem Klick auf den Button <i>Weiter</i>.<br>
			&nbsp;<br>
			Jetzt wird Ihnen eine Zusammenfassung der vorgenommenen Einstellungen angezeigt und Sie k&ouml;nnen das Kopieren der Dateien mit einem Klick auf den Button <i>Installieren</i> einleiten. Anschlie&szlig;end werden die Dateien extrahiert und installiert.<br>
			&nbsp;<br>
			Eine Meldung informiert Sie zum Schluss &uuml;ber die erfolgreiche Installation und bietet Ihnen die M&ouml;glichkeit, das Programm direkt zu starten. W&uuml;nschen Sie dies nicht, entfernen Sie einfach den Haken bei <i>TIPP10 starten</i>. Beenden Sie nun die Installation mit einem Klick auf den Button <i>Fertigstellen</i>. Das Programm wurde nun erfolgreich installiert.<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="windows_portable"></a>
			<b>3.2.2 Portable Version</b><br>
			&nbsp;<br>
			Die portable Version von TIPP10 liegt als <i>ZIP</i>-Archiv vor und Sie m&uuml;ssen diese zuerst entpacken. Normalerweise sollte es ausreichen, wenn Sie einen Doppelklick auf die Datei <i>tipp10_win_portable_2-1-0.zip</i> ausf&uuml;hren und den Extrahierungs-Schritten von Windows folgen. Sollten Sie &uuml;ber kein Programm zum Entpacken von <i>ZIP</i>-Dateien verf&uuml;gen, m&uuml;ssen Sie erst eine geeignete Software, z.B. <i>WinZIP</i> oder <i>WinRAR</i>, installieren.<br>
			&nbsp;<br>
			Nachdem Sie die Datei entpackt haben, sollten Sie einen Ordner <i>tipp10_win_portable_2-1-0</i> vorfinden. In diesem Ordner befinden sich die eigentlichen Programmdateien und hier werden auch Ihre Ergebnisse gespeichert. Sie k&ouml;nnen den Ordner nun bei Bedarf auf ein externes Laufwerk (z.B. einen USB-Stick) verschieben und TIPP10 so von jedem Windows-PC ausf&uuml;hren. Um TIPP10 zu starten, navigieren Sie einfach in den Ordner <i>tipp10_win_portable_2-1-0</i> und starten Sie die Datei <i>tipp10.exe</i> mit einem Doppelklick.<br>
			&nbsp;<br>
			TIPP10 erstellt nach dem ersten Start eine neue Benutzerdatenbank <i>tipp10v2.db</i> innerhalb des Ordners, um Ihre pers&ouml;nlichen Ergebnisse zu speichern. Mehr Informationen zu der Speicherung der Daten finden Sie im <a href="features.html#database">Kapitel 2.3</a>.<br>
			&nbsp;<br>
			&nbsp;
		</p>
		<a name="mac"></a>
		<p class="headline2">
			3.3 Installation unter Mac OS
		</p>
		<p class="standard">
			Die Macintosh-Version von TIPP10 wird als Imagedatei ausgeliefert. F&uuml;hren Sie einen Doppelklick auf die Datei <i>tipp10_mac_2-1-0.dmg</i> (eventuell sehen Sie die Endung <i>.dmg</i> nicht) aus, um die Lizenzvereinbarung anzuzeigen.<br>
			&nbsp;<br>
			Lesen Sie sich die Vereinbarung sorgf&auml;ltig durch. Erst nachdem Sie diese akzeptiert haben, wird das Image verbunden und es wird Ihnen das Installationsfenster angezeigt.<br>
			&nbsp;<br>
			<img src="../img/h_installer_mac.png" width="220" height="162" border="0"><br>
			&nbsp;<br>
			Ziehen Sie nun einfach mit der Maus das Icon <i>TIPP10</i> in den Ordner <i>Programme</i>. TIPP10 ist nun installiert und befindet sich in Ihren Programmen. Sie k&ouml;nnen nun bei Bedarf das Image &uuml;ber den <i>Finder</i> auswerfen und die Imagedatei l&ouml;schen. Sie ben&ouml;tigen diese Datei nun nicht mehr.<br>
			&nbsp;<br>
			Um TIPP10 zu starten, &ouml;ffnen Sie den <i>Finder</i> und w&auml;hlen Sie im linken Men&uuml; <i>Programme</i> aus. Jetzt k&ouml;nnen Sie das Programm starten, indem Sie auf der rechten Seite das Icon <i>TIPP10</i> doppelt anklicken.<br>
			&nbsp;<br>
			Sollten Sie ohne Umwege jederzeit auf das Programm zugreifen wollen, k&ouml;nnen Sie das Icon auch mit der Maus auf Ihren <i>Schreibtisch</i> oder das <i>Dock</i> bewegen.<br>
			&nbsp;
		</p>
		<a name="linux"></a>
		<p class="headline2">
			3.4 Installation unter Linux
		</p>
		<p class="standard">
			Derzeit existieren Installationsanleitungen f&uuml;r die Linux-Distributionen Ubuntu, Kubuntu, OpenSuse und Puppy Linux. TIPP10 sollte aber auch unter anderen Linux-Systemen reibungslos laufen.<br>
			&nbsp;
		</p>
		<p class="standard">
			<a name="linux_ubuntu"></a>
			<b>3.4.1 (K)Ubuntu Linux</b><br>
			&nbsp;<br>
			Sie k&ouml;nnen TIPP10 unter (K)Ubuntu &uuml;ber ein fertiges Debian-Paket und den Paketmanager installieren oder manuell &uuml;ber die herk&ouml;mmliche Weise vornehmen.<br>
			Ein aktuelles Wiki f&uuml;r die Installation von TIPP10 unter Ubuntu finden Sie auch im Internet unter <a href="http://wiki.ubuntuusers.de/Schreibtrainer" target="_blank">http://wiki.ubuntuusers.de/Schreibtrainer</a>.<br>
			&nbsp;<br>
			<b>Installation &uuml;ber den Paketmanager</b><br>
			&nbsp;<br>
			Um das fertige Debian-Paket zu installieren, laden Sie die Datei <i>tipp10_debian_2-1-0.deb</i> von der Projektseite herunter. Anschlie&szlig;end k&ouml;nnen Sie auf den jeweiligen Paketmanager Ihrer Distribution zur&uuml;ckgreifen, um das Paket zu installieren. Unter Ubuntu ist das normalerweise <i>gdebi</i>, unter Kubuntu die Softwareverwaltung oder <i>gdebi-kde</i>. Genauere Informationen zum Installieren von Debian-Paketen finden Sie unter <a href="http://wiki.ubuntuusers.de/Paketinstallation_DEB" target="_blank">http://wiki.ubuntuusers.de/Paketinstallation_DEB</a>.<br>
			Nach der Installation k&ouml;nnen Sie TIPP10 &uuml;ber <i>Anwendungen</i> - <i>Bildung</i> - <i>TIPP10</i> aus dem Startmen&uuml; heraus starten.<br>
			&nbsp;<br>
			<b>Manuelle Installation</b><br>
			&nbsp;<br>
			Um TIPP10 auf die manuelle Weise zu installieren, laden Sie das Archiv <i>tipp10_linux_v2-1-0.tar.gz</i> von der Projektseite herunter. Das Archiv enth&auml;lt bereits eine fertig ausf&uuml;hrbare Programmdatei <i>tipp10</i>. Der Ordnung halber sollte man mit den folgenden Befehlen den Programmordner nach <i>/opt/</i> verschieben und eine Verkn&uuml;pfung in <i>/usr/local/bin/</i> anlegen:
		</p>
		<p class="code">
			sudo tar -xzf tipp10_linux_v2-1-0.tar.gz -C /opt/<br>
			sudo ln -s /opt/tipp10/tipp10 /usr/local/bin/
		</p>
		<p class="standard">
			Das Programm kann nun &uuml;ber das Terminal mit folgendem Befehl gestartet werden:
		</p>
		<p class="code">
			tipp10
		</p>
		<p class="standard">
			Um nun einen Starteintrag zu erstellen, erzeugen Sie mit einem Editor und mit Root-Rechten die Datei <i>/usr/share/applications/tipp10.desktop</i> und f&uuml;gen diesen Inhalt ein:
		</p>
		<p class="code">
			[Desktop Entry]<br>
			Encoding=UTF-8<br>
			Name=TIPP10<br>
			Comment=Touch Typing Software<br>
			Comment[de]=10-Finger-Schreibtrainer<br>
			Exec=tipp10<br>
			Icon=/opt/tipp10/tipp10.png<br>
			Terminal=false<br>
			Type=Application<br>
			Categories=Education;
		</p>
		<p class="standard">
			Nach dem Speichern der Datei l&auml;sst sich TIPP10 &uuml;ber <i>Anwendungen</i> - <i>Bildung</i> - <i>TIPP10</i> aus dem Startmen&uuml; heraus starten.<br>
			&nbsp;
		</p>
		<p class="standard">
			<a name="linux_opensuse"></a>
			<b>3.4.2 OpenSuse</b><br>
			&nbsp;<br>
			Folgende Anleitung wurde getestet mit OpenSuse 10.1.
		</p>
		<p class="standard">
			1. Laden Sie die Datei <i>tipp10_linux_v2-1-0.tar.gz</i> von der Projektseite herunter.
		</p>
		<p class="standard">
			2. Archiv entpacken. F&uuml;hren Sie die folgenden Befehle in Ihrem Terminal aus:
		</p>
		<p class="code">
			tar -xvvzf tipp10_linux_*.tar.gz<br>
			rm tipp10_linux_*.tar.gz<br>
			ln -s /$HOME/tipp10 /$HOME/Desktop/tipp10<br>
			cd $HOME
		</p>
		<p class="standard">
			3. &Ouml;ffnen Sie auf dem Desktop den Ordner <i>tipp10</i>.
		</p>
		<p class="standard">
			4. Um das Programm zu starten f&uuml;hren Sie die Datei <i>tipp10</i> aus.
		</p>
		<p class="standard">
			5a. Sollte TIPP10 nach dem Start den Fehler Nummer 309 melden, schliessen Sie zuerst TIPP10.
		</p>
		<p class="standard">
			5b. F&uuml;hren Sie anschlie&szlig;end den folgenden Befehl in Ihrem Terminal aus:
		</p>
		<p class="code">
			chmod u+w $HOME/tipp10/tipp10v2.db
		</p>
		<p class="standard">
			5c. Starten Sie nun erneut TIPP10 (indem Sie die Datei <i>tipp10</i> ausf&uuml;hren).<br>
			&nbsp;
		</p>
		<p class="standard">
			<a name="linux_puppy"></a>
			<b>3.4.3 Puppy Linux</b>
		</p>
		<p class="standard">
			Vielen Dank an Steffen G&ouml;tz f&uuml;r die Ver&ouml;ffentlichung dieser Anleitung!<br>
			&nbsp;<br>
			1. Kompilierumgebung einrichten (wenn nicht schon getan)<br>
			2. glibc auf Version 2.5 updaten<br>
			3. TIPP10 entpacken<br>
			4. Datei tipp10 starten<br>
			5. Desktopverkn&uuml;pfung erstellen und evtl. Men&uuml;eintrag<br>&nbsp;<br>
			zu 1:<br>Es gibt verschiedene M&ouml;glichkeiten, Puppy-Linux zu benutzen. In erster Linie "live" (CD, USB, etc.) oder von Festplatte (minimal oder richtige Installation - hierzu wird aber bereits ein Bootloader ben&ouml;tigt, z.B. Grub).<br>
			Kompilierumgebung einrichten bei CD-, USB-, und mimimal Nutzung:<br>
			a) Die Datei devx_XXX.sfs downloaden (<a href="ftp://ibiblio.org/pub/linux/distributions/puppylinux/" target="_blank">ftp://ibiblio.org/pub/linux/distributions/puppylinux/</a>). XXX steht f&uuml;r die Puppy-Version (z.B. 2.17). Die Datei mu&szlig; sich im gleichen Verzeichnis befinden wie die Datei pup_save_XXX.2fs!<br>
			b) Kurztest: cc auf der Konsole eingeben, die Antwort sollte "cc: no input files" lauten (evtl. einen Reboot durchf&uuml;hren).<br>
			Bei der richtigen Festplattenistallation ist die Einrichtung der Kompilierumgebung etwas komplizierter. Da es hier um TIPP10 geht, wird dieser Vorgang nicht mehr genauer erl&auml;utert, im Internet finden sich dazu aber weitere Informationen.<br>
			&nbsp;<br>
			zu 2:<br>Klick auf install (Desktop), Klick auf PETget (und nochmal), glibc-2.5 ausw&auml;hlen und den Anweisungen folgen (thank you Barry&Co). Die Installation dieser call-library erm&ouml;glicht die Installation vieler Programme unter Puppy, da sie etwas moderner ist (nptl).<br>
			&nbsp;<br>
			zu 3:<br>tipp10v2_linux_v2-1-0.tar.gz in einem geeigneten Verzeichnis ablegen (z.B. /root/my-applicatios) und entpacken (draufklicken). Siehe dazu auch die Anleitung f&uuml;r die Installation unter OpenSuse im Kapitel 3.3.1.<br>
			&nbsp;<br>
			zu 4:<br>In das Verzeichnis tipp10 wechseln und auf die Datei tipp10 klicken. Voila!? Ansonsten eine Konsole &ouml;ffnen (Rechtsklick, window, terminal here) und ./tipp10 eingeben.<br>
			&nbsp;<br>
			zu 5:<br>Abschlie&szlig;end kann man die Datei auch noch auf den Desktop ziehen und mit einem entsprechendem Icon versehen (Kontextmen&uuml;). F&uuml;r den Eintrag in das Men&uuml; (/root/.jwmrc) siehe Puppy-Linux Dokumentation.<br>
			&nbsp;
		</p>
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="features.html">Merkmale von TIPP10</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="behaviour.html">Ergonomie am Arbeitsplatz</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="small">
			&copy; 2006-2011 Tom Thielicke IT Solutions
		</p>
	  </div>
	</body>
</html>