<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
	<head>
		<title>TIPP10 Bedienungsanleitung</title>
		<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body style="background-color: rgb(255, 255, 255);" bgcolor="#FFFFFF" marginheight="0" marginwidth="0" leftmargin="10" topmargin="10">
	  <div class="container">
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="lessons.html">Schreibtraining</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="training.html">Trainingsablauf</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="headline2">
			6.2 Trainingsparameter
		</p>
		<p class="standard">
			Auf der rechten Seite des Startfensters k&ouml;nnen Sie die Trainingsparameter einstellen. Diese sind untergliedert in drei Bereiche.<br>
			&nbsp;<br>
			<img src="../img/h_home_settings.png" width="200" height="211" border="0"><br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="lessonduration"></a>
			<b>6.2.1 Dauer der Lektion</b><br>
			&nbsp;<br>
			Da das Diktat der &Uuml;bungslektionen in Abh&auml;ngigkeit von Ihren Tippfehlern unterschiedlich ausf&auml;llt, l&auml;sst sich die Dauer der Lektion normalerweise nur auf zwei Arten festlegen. Entweder &uuml;ber ein <i>Zeitlimit</i> oder &uuml;ber die Anzahl der zu diktierenden Zeichen (<i>Zeichenlimit</i>). Bei freien und eigenen Lektionen l&auml;sst sich bei deaktivierter Intelligenz auch <i>Gesamte Lektion</i> ausw&auml;hlen, damit die Texte der Lektion von Anfang bis Ende genau einmal diktiert werden.<br>
			&nbsp;<br>
			Nach der Installation der Software ist eine Zeitdauer von f&uuml;nf Minuten voreingestellt. Eine Zeitdauer von f&uuml;nf Minuten entspricht, bei fehlerfreier Eingabe und einer Schreibgeschwindigkeit von 100 Anschl&auml;gen pro Minute, einem Zeichenlimit von 500 Zeichen.<br>
			&nbsp;<br>
			Hinweis: Wenn Sie die Intelligenz (siehe weiter unten) deaktivieren, wird automatisch die Option <i>Gesamte Lektion</i> ausgew&auml;hlt. Sie k&ouml;nnen diese Automatik in den Grundeinstellungen abschalten (siehe <a href="settings.html#settingsfittings">Kapitel 7.4</a>).<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="lessonerrorhandling"></a>
			<b>6.2.2 Reaktion auf Tippfehler</b><br>
			&nbsp;<br>
			Der Schreibtrainer bietet Ihnen unterschiedliche M&ouml;glichkeiten, auf Ihre Tippfehler zu reagieren.<br>
			&nbsp;<br>
			<i>Tippfehler blockieren</i> bedeutet, dass das Diktat bei jedem Tippfehler stoppt und darauf wartet, dass Sie dann die korrekte Taste dr&uuml;cken. Das Zeichen, das fehlerhaft eingegeben wurde, wird im Lauftext orange markiert. Diese Option ist nach der Installation der Software voreingestellt. Wird die Option deaktiviert, werden Ihre Tippfehler zwar gez&auml;hlt, jedoch &uuml;bergeht der Schreibtrainer den Fehler und fordert Sie auf, sofort das n&auml;chste Zeichen einzugeben.<br>
			&nbsp;<br>
			Ist <i>Tippfehler blockieren</i> aktiviert, haben Sie zus&auml;tzlich die M&ouml;glichkeit, die Option <i>Tippfehler korrigieren</i> zu selektieren. Tippfehler korrigieren bedeutet, dass Sie jeden Tippfehler zuerst mit der R&uuml;cklauftaste l&ouml;schen m&uuml;ssen, bevor Sie die korrekte Taste dr&uuml;cken und damit das Schreibtraining fortsetzen k&ouml;nnen. Diese Option entspricht am ehesten der Realit&auml;t, sie ist jedoch nach der Installation nicht voreingestellt, da sie nur f&uuml;r fortgeschrittene Benutzer geeignet ist.<br>
			&nbsp;<br>
			W&uuml;nschen Sie bei jedem Tippfehler ein akustisches Signal, das &uuml;ber die Soundkarte oder in Form eines Pieptons &uuml;ber den PC-internen Lautsprecher ausgegeben wird (siehe Grundeinstellungen im <a href="settings.html">Kapitel 7.1</a>), markieren Sie die Option <i>Akustisches Signal</i> mit einem Mausklick.<br>
			&nbsp;<br>
			Die Option <i>Intelligenz</i> ist nur bei <i>freien</i> und <i>eigenen Lektionen</i> aktiv. Bei &Uuml;bungslektionen ist die Intelligenz stets eingeschaltet, daher ist die Option dann grau hinterlegt.<br>
			Wenn die <i>Intelligenz</i> aktiviert ist, werden die Zeilen (Worte oder S&auml;tze) des Diktats nicht der Reihenfolge nach diktiert, sondern abh&auml;ngig von den Tippfehler-Quoten die aktuell f&uuml;r den Lernerfolg sinnvollste Zeile in das Diktat einbezogen. Dies kann sehr sinnvoll sein, wenn Sie gezielt bestimmte Gewohnheitsfehler loswerden wollen, allerdings ergibt der Text des Diktats meist wenig oder keinen Sinn.<br>
			Ist die Intelligenz abgeschaltet, wird das Diktat in der vorgesehenen Reihenfolge diktiert und Sie k&ouml;nnen bei der <i>Dauer der Lektion</i> (siehe oben) auch die Option <i>Gesamte Lektion</i> ausw&auml;hlen.<br>
			&nbsp;<br>
			Hinweis: Die Intelligenzfunktion zu aktivieren macht nur bei Lektionen Sinn, die aus sehr vielen Zeilen bestehen. Weitere Informationen finden Sie auch bei den eigenen Lektionen im <a href="lessons.html#ownlessons">Kapitel 6.1.3</a>.<br>
			&nbsp;<br>
			&nbsp;<br>
			<a name="lessonhelpers"></a>
			<b>6.2.3 Hilfestellungen</b><br>
			&nbsp;<br>
			Es existieren verschiedene visuelle Hilfestellungen, die Sie beim Schreibtraining unterst&uuml;tzen. Alle Hilfestellungen sind nach der Installation der Software voreingestellt.<br>
			Die Option <i>Tastatur anzeigen</i> entscheidet dar&uuml;ber, ob &uuml;berhaupt Hilfen in Form einer virtuellen Tastatur dargestellt werden sollen. Wird diese Option deaktiviert, wird Ihnen beim Schreibtraining lediglich das Laufband und die Statusleiste angezeigt.<br>
			&nbsp;<br>
			Wenn Sie die Tastatur jedoch aktiviert haben, k&ouml;nnen Sie sich auch einzelne Hilfsoptionen an- und abschalten:<br>
			&nbsp;<br>
			Ist die Option <i>Farbige Tasten</i> selektiert, werden Ihnen die zu dr&uuml;ckenden Tasten auf einer visuellen Tastatur farbig dargestellt. Die Farbe zeigt Ihnen dabei an, mit welchem Finger die jeweilige Taste zu bet&auml;tigen ist.<br>
			&nbsp;<br>
			Die Option <i>Grundstellung</i> sorgt daf&uuml;r, dass Ihnen zu Beginn und w&auml;hrend des Schreibtrainings stets die Grundstellung angezeigt wird.<br>
			&nbsp;<br>
			Die Hilfestellung <i>Tastpfade</i> bewirkt, dass Ihnen f&uuml;r jeden Finger der Weg zu einer Taste au&szlig;erhalb der Grundstellung angezeigt wird.<br>
			&nbsp;<br>
			<i>Trennlinie links/rechts</i> aktiviert eine schwarze Trennlinie die Ihnen verdeutlicht, welche Tasten mit der linken und welche Tasten mit der rechten Hand zu bet&auml;tigen sind.<br>
			&nbsp;<br>
			Die Option <i>Hilfetext anzeigen</i> bewirkt, dass Ihnen &uuml;ber einen Text in der Statuszeile mitgeteilt wird, welchen Finger Sie f&uuml;r die aktuell zu dr&uuml;ckende Taste verwenden sollen.<br>
			&nbsp;<br>
			F&uuml;r Benutzer ohne Erfahrung mit dem Zehnfingersystem wird empfohlen, alle Hilfestellungen vorerst zu aktivieren.<br>
			&nbsp;
		</p>
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="lessons.html">Schreibtraining</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="training.html">Trainingsablauf</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="small">
			&copy; 2006-2011 Tom Thielicke IT Solutions
		</p>
	  </div>
	</body>
</html>