<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
	<head>
		<title>TIPP10 Bedienungsanleitung</title>
		<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body style="background-color: rgb(255, 255, 255);" bgcolor="#FFFFFF" marginheight="0" marginwidth="0" leftmargin="10" topmargin="10">
	  <div class="container">
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="results.html">Lernstatistik anzeigen</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="game.html">ABC-Spiel</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="headline1">
			7. Grundeinstellungen
		</p>
		<p class="standard">
			Die Grundeinstellungen erreichen Sie &uuml;ber die Men&uuml;leiste des Startfensters. Klicken Sie hierf&uuml;r unter Windows und Linux auf das Men&uuml; <i>Datei</i> und dann auf den Unterpunkt <i>Grundeinstellungen</i>. Unter Mac OS klicken Sie bitte auf <i>TIPP10</i> und dann auf <i>Einstellungen</i>.<br>
			&nbsp;<br>
			Die Grundeinstellungen teilen sich in vier Bereiche: <i>Schreibtraining</i>, <i>Sprache</i>, <i>Lernstatistik</i> und <i>Sonstiges</i>.<br>
			&nbsp;
		</p>
		<a name="settingstraining"></a>
		<p class="headline2">
			7.1 Schreibtraining
		</p>
		<p class="standard">
			Hier k&ouml;nnen Sie Einstellungen vornehmen, die das Schreibtraining betreffen.<br>
			&nbsp;<br>
			<img src="../img/h_settings_training.png" width="240" height="193" border="0"><br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.1.1 Laufschrift</b><br>
			&nbsp;<br>
			Sie k&ouml;nnen Schriftart und -gr&ouml;&szlig;e, sowie die Farben der Laufschrift im Schreibtraining an Ihre Bed&uuml;rfnisse anpassen. Klicken Sie dazu auf den jeweiligen Button und w&auml;hlen Sie dann die gew&uuml;nschte Schrift bzw. Farbe aus. Beachten Sie, dass eine Schriftgr&ouml;&szlig;e von mehr als 20 Punkten nicht empfohlen ist, da sie sonst durch das Laufband oben und unten abgeschnitten wird.<br>
			&nbsp;<br>
			Die Geschwindigkeit, mit der sich die Laufschrift bewegt, k&ouml;nnen Sie mit einem Regler beeinflussen. Es existieren insgesamt f&uuml;nf Stufen, standardm&auml;&szlig;ig befindet sich der Regler in der Mitte. Wenn Sie den Regler mit der Maus ganz nach links verschieben, bewegt sich die Laufschrift gar nicht mehr, befindet sich der Regler ganz rechts, bewegt sich die Laufschrift sehr schnell.<br>
			&nbsp;<br>
			Manche Benutzer empfinden die Laufschrift nach l&auml;ngerem Training als anstrengend und st&ouml;rend. In diesem Fall wird empfohlen, andere Farben auszuw&auml;hlen oder die Laufschrift ganz auszuschalten (Regler ganz nach links bewegen).<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.1.2 Audioausgabe</b><br>
			&nbsp;<br>
			Sie k&ouml;nnen festlegen, ob akustische Signale (f&uuml;r Tippfehler und Metronom) &uuml;ber die Soundkarte oder &uuml;ber den internen PC-Lautsprecher ausgegeben werden sollen. Bei Ausgabe &uuml;ber die Soundkarte werden die Audiodateien <i>error.wav</i> und <i>metronome.wav</i> aus dem Programmverzeichnis abgespielt. Bei Ausgabe &uuml;ber den PC-Lautsprecher kann lediglich ein Piepton erfolgen.<br>
			&nbsp;<br>
			Bei Aktivierung des Metronoms, wird w&auml;hrend des Trainings ein Ticken in einem vorgegebenen Zeittakt abgespielt. Dies kann Sie unter Umst&auml;nden dabei unterst&uuml;tzen, gleichm&auml;&szlig;ig in einer festen Geschwindigkeit zu tippen. Die Geschwindigkeit k&ouml;nnen Sie in Anschl&auml;gen pro Minute einstellen. Bei beispielsweise 60 Anschl&auml;gen pro Minute h&ouml;ren Sie genau einmal pro Sekunde ein Ticken.<br>
			&nbsp;
		</p>
		<a name="settingslanguage"></a>
		<p class="headline2">
			7.2 Sprache
		</p>
		<p class="standard">
			Hier k&ouml;nnen Sie die Sprache festlegen, die f&uuml;r Programmoberfl&auml;che, &Uuml;bungslektionen und das Tastaturlayout verwendet wird.<br>
			&nbsp;<br>
			<img src="../img/h_settings_language.png" width="240" height="193" border="0"><br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.2.1 Programmoberfl&auml;che</b><br>
			&nbsp;<br>
			Die Programmoberfl&auml;che von TIPP10 wird derzeit in den Sprachen Deutsch und Englisch angeboten. &Uuml;ber die Listenauswahl k&ouml;nnen Sie die Sprache &auml;ndern.<br>
			Beachten Sie, dass diese Einstellung lediglich die Sprache aller Bedienungselemente &auml;ndert. Die Sprache der Lektionen k&ouml;nnen Sie weiter unten anpassen.<br>
			&nbsp;<br>
			Die &Auml;nderung der Programmoberfl&auml;che erfordert einen Neustart der Software. Sie werden darauf nach dem Speichern der Grundeinstellungen hingewiesen.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.2.2 Tastaturlayout</b><br>
			&nbsp;<br>
			TIPP10 unterst&uuml;tzt neben dem deutschen Tastaturlayout auch das Layout der Schweiz, das Layout der USA und die alternativen Tastaturlayouts <i>NEO</i>, <i>Dvorak</i> und <i>RISTOME</i>. In der Listenauswahl k&ouml;nnen Sie die zu Ihrem Computer passende Tastatur einstellen.<br>
			&nbsp;<br>
			Nachfolgend einige Hinweise zu den unterschiedlichen Tastaturlayouts:<br>
			&nbsp;<br>
			1. Bei dem Tastaturlayout <i>Deutschland | QWERTZ</i> handelt es sich um das normale deutsche Tastaturlayout.<br>
			&nbsp;<br>
			2. Das Windows-Layout unterscheidet sich leicht vom Apple-Layout (Windows- und Apfel/CMD-Tasten, @-Zeichen etc.). W&auml;hlen Sie daher die entsprechende Erweiterung <i>Windows</i> oder <i>Macintosh</i>.<br>
			&nbsp;<br>
			3. Bei Auswahl des Tastaturlayouts <i>Schweiz | QWERTZ</i> k&ouml;nnen Sie zus&auml;tzlich noch festlegen, ob es sich um eine deutsch-schweizerische (<i>SG</i>) oder franz&ouml;sisch-schweizerische (<i>SF</i>) Tastatur handelt. Au&szlig;erdem werden im Diktat automatisch alle gro&szlig;en Umlaute und Szet (&szlig;) durch alternative Zeichenfolgen (&szlig; -> ss, &Auml; -> Ae, &Uuml; -> Ue, usw.) ersetzt!<br>
			&nbsp;<br>
			4. Bei Auswahl des amerikanischen Tastaturlayouts <i>USA | QWERTY</i> werden im Diktat automatisch alle Umlaute und Szet (&szlig;) durch alternative Zeichenfolgen (&szlig; -> ss, &Auml; -> Ae, &uuml; -> ue, usw.) ersetzt!<br>
			&nbsp;<br>
			5. Alternative Systeme, wie das 1936 erfundene <i>Dvorak</i>-Tastaturlayout des Amerikaners <i>August Dvorak</i>, das 2005 von <i>Jugend forscht</i> preisgekr&ouml;nte Layout namens <i>RISTOME</i> oder das Tastaurlayout <i>NEO</i> erlauben schnelleres und f&uuml;r die Gelenke ges&uuml;nderes Tippen. Aufgrund der weiten Verbreitung des <i>QWERTY/Z</i>-Systems und des enormen Aufwands, der f&uuml;r die allgemeine Einf&uuml;hrung eines neuen Systems n&ouml;tig w&auml;re, haben sie sich bislang aber nur in kleinen Kreisen durchgesetzt. Zahlreiche Informationen zu den alternativen Tastaturlayouts finden sich im Internet. Die Unterscheidung zwischen <i>Windows</i> und <i>Macintosh</i> f&auml;llt bei den alternativen Layouts weg, da es sich im Normalfall um umgebaute Windows-Tastaturen handelt und kein Unterschied bei der Tastenanordnung besteht.<br>
			&nbsp;<br>
			6. Sollten Sie den Umfang der f&uuml;r das Tastaturlayout verf&uuml;gbaren Schriftzeichen zus&auml;tzlich anpassen wollen, erreichen Sie &uuml;ber den Button <i>Erweitert</i> die <i>Zeichenbegrenzung</i> und den <i>Ersetzungsfilter</i>. Bitte nehmen Sie hier nur &Auml;nderungen vor, wenn Sie sich mit regul&auml;ren Ausdr&uuml;cken auskennen. &Auml;nderungen werden nur solange gespeichert, bis Sie ein anderes Tastaturlayout ausw&auml;hlen. Weitere Erl&auml;uterungen werden im Fenster angezeigt.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.2.3 &Uuml;bungslektionen</b><br>
			&nbsp;<br>
			Die &Uuml;bungslektionen sind im Idealfall genau auf das jeweilige Tastaturlayout abgestimmt, damit die einzelnen Tasten von der Grundstellung ausgehend schrittweise erlernt werden k&ouml;nnen. Sie k&ouml;nnen zwar auch z.B. an das deutsche <i>QWERTZ</i>-Layout angepasste &Uuml;bungslektionen mit dem amerikanischen <i>QWERTY</i>-Tastaturlayout trainieren, m&uuml;ssen dann aber unter Umst&auml;nden von Beginn an Tastwege zur&uuml;cklegen.<br>
			&nbsp;<br>
			TIPP10 bietet derzeit deutsche &Uuml;bungslektionen f&uuml;r die Tastaturlayouts <i>QWERTZ</i> und <i>NEO 2.0</i> und englische Lektionen f&uuml;r das amerikanische <i>QWERTY</i>-Layout an. Diese k&ouml;nnen Sie die &uuml;ber die Listenauswahl einstellen.<br>
			&nbsp;
		</p>
		<a name="settingsdatabase"></a>
		<p class="headline2">
			7.3 Lernstatistik
		</p>
		<p class="standard">
			Hier k&ouml;nnen Sie die Lernstatistik verwalten.<br>
			&nbsp;<br>
			<img src="../img/h_settings_database.png" width="240" height="193" border="0"><br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.3.1 Benutzerdaten</b><br>
			&nbsp;<br>
			&Uuml;ber den Button <i>Absolvierte Lektionen zur&uuml;cksetzen</i> k&ouml;nnen Sie alle Lektionendaten l&ouml;schen, die w&auml;hrend des Schreibtrainings in die Datenbank gespeichert wurden. Es handelt sich hierbei um alle Ergebnisse der Lektionen, also welche Lektionen trainiert und wie diese bewertet wurden. Die Lektionenliste und der Verlauf der Lektionen in der Lernstatistik werden danach leer angezeigt, wie nach der Installation von TIPP10.<br>
			&nbsp;<br>
			Der Button <i>Aufgezeichnete Schriftzeichen zur&uuml;cksetzen</i> bewirkt, dass alle Fehlerquoten der Schriftzeichen entfernt werden. Es bleibt zwar erhalten, wie viele Fehler in einer Lektion gemacht wurden (diese Information wird &uuml;ber den Button <i>Absolvierte Lektionen zur&uuml;cksetzen</i> gel&ouml;scht), jedoch wird zur&uuml;ckgesetzt, welche Schriftzeichen Sie am h&auml;ufigsten falsch getippt haben. Die Liste der Schriftzeichen und die Darstellung der Finger in der Lernstatistik wird nach dem L&ouml;schvorgang leer dargestellt und die Intelligenzfunktion reagiert erst auf wieder neu entstehende Tippfehler.<br>
			&nbsp;<br>
			Wenn Sie beide L&ouml;sch-Vorg&auml;nge durchf&uuml;hren, befindet sich die Datenbank wieder in dem Zustand, in dem sie sich direkt nach der Installation befunden hat.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.3.2 Speicherort</b><br>
			&nbsp;<br>
			Im Bereich <i>Speicherort</i> k&ouml;nnen Sie festlegen, wo sich auf Ihrer Festplatte die TIPP10-Datenbank <i>tipp10v2.db</i> befindet. Standardm&auml;&szlig;ig wird die Datenbank beim ersten Programmstart im <i>HOME</i>-Verzeichnis des Benutzers angelegt. Bei der portablen Windows-Version von TIPP10 wird die Datenbank grunds&auml;tzlich im Programmverzeichnis abgelegt, hier kann der Pfad nicht ver&auml;ndert werden.<br>
			&nbsp;<br>
			Bei Windows ist das Verzeichnis normalerweise unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			C:\Dokumente und Einstellungen\<i>Benutzername</i>\Anwendungsdaten\TIPP10\
		</p>
		<p class="standard">
			Bei Mac OS ist das Verzeichnis normalerweise unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			/Users/<i>Benutzername</i>/Library/Application Support/TIPP10/
		</p>
		<p class="standard">
			Bei Linux ist das Verzeichnis normalerweise unter folgendem Pfad zu finden:
		</p>
		<p class="code">
			/home/<i>Benutzername</i>/TIPP10/
		</p>
		<p class="standard">
			Im Ordner <i>TIPP10</i> liegt dann die Datenbankdatei <i>tipp10v2.db</i>. Beachten Sie, dass bei der Pfadeingabe lediglich das Verzeichnis angegeben wird. Die Datenbankdatei selbst wird nicht eingegeben. Wenn Sie ein leeres Verzeichnis angeben, wird automatisch eine neue, leere Datenbank erzeugt.<br>
			&nbsp;<br>
			Weitere Informationen zur Handhabung der Datenbank finden Sie im <a href="features.html#database">Kapitel 2.3</a>.<br>
			&nbsp;
		</p>
		<a name="settingsfittings"></a>
		<p class="headline2">
			7.4 Sonstiges
		</p>
		<p class="standard">
			Hier k&ouml;nnen Sie Einstellungen vornehmen, die die Programmbenutzung und den Umgang mit Informationsfenstern betreffen.<br>
			&nbsp;<br>
			<img src="../img/h_settings_other.png" width="240" height="193" border="0"><br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.4.1 Fenstereinstellungen</b><br>
			&nbsp;<br>
			Die erste Option bestimmt, ob nach dem Programmstart ein Fenster angezeigt werden soll, das Programmhinweise und Tipps zu Anwendung des Zehnfingersystems beinhaltet.<br>
			&nbsp;<br>
			Die zweite Option entscheidet, ob der Benutzer einen Hinweis erhalten soll, wenn eine freie oder eigene Lektion mit aktivierter Intelligenz gestartet wird.<br>
			&nbsp;<br>
			Die dritte Option legt fest, ob die Dauer der Lektion automatisch auf <i>Gesamte Lektion</i> springen soll, wenn bei einer freien oder eigenen Lektion die <i>Intelligenz</i> deaktiviert wird. TIPP10 merkt sich, ob Sie die <i>Intelligenz</i> aktiviert haben und setzt die Dauer auch auf <i>Gesamte Lektion</i>, wenn Sie nur zu den freien oder eigenen Lektionen &uuml;ber das Register wechseln. W&uuml;nschen Sie dieses Verhalten nicht, deaktivieren Sie die Option.<br>
			&nbsp;<br>
			&nbsp;<br>
			<b>7.4.2 Sonstiges</b><br>
			&nbsp;<br>
			Bei der ersten Option k&ouml;nnen Sie bestimmen, ob TIPP10 einmal pro Woche beim Programmstart auf eine neue Softwareversion pr&uuml;fen soll. TIPP10 stellt dazu eine Anfrage &uuml;ber das Internet und informiert Sie, wenn eine neue Version vorliegt.<br>
			&nbsp;<br>
			Aktivieren Sie die zweite Option, wenn die Software mit der nativen Programmoberfl&auml;che dargestellt werden soll. TIPP10 verwendet dann f&uuml;r alle Steuerelemente das Oberfl&auml;chendesign des Betriebssystems.<br>
			&nbsp;
		</p>
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="results.html">Lernstatistik anzeigen</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="game.html">ABC-Spiel</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="small">
			&copy; 2006-2011 Tom Thielicke IT Solutions
		</p>
	  </div>
	</body>
</html>