<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
	<head>
		<title>TIPP10 Bedienungsanleitung</title>
		<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body style="background-color: rgb(255, 255, 255);" bgcolor="#FFFFFF" marginheight="0" marginwidth="0" leftmargin="10" topmargin="10">
	  <div class="container">
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="behaviour.html">Ergonomie am Arbeitsplatz</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="lessons.html">Schreibtraining</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="headline1">
			5. Programmstart
		</p>
		<p class="standard">
			Um den 10-Finger-Schreibtrainer TIPP10 unter Windows (installierbare Version) zu starten, &ouml;ffnen Sie das Startmen&uuml;, w&auml;hlen dann Programme und klicken im Eintrag <i>TIPP10</i> auf <i>TIPP10</i>. Falls Sie eine Desktop-Verkn&uuml;pfung angelegt haben, k&ouml;nnen Sie das Programm auch direkt &uuml;ber einen Doppelklick auf die Verkn&uuml;pfung <i>TIPP10</i> des Desktops starten.<br>
			&nbsp;<br>
			Bei der portablen Windows-Version navigieren Sie einfach in den Ordner <i>tipp10_win_portable_v2-1-0</i> und starten Sie die Datei <i>tipp10.exe</i> mit einem Doppelklick.<br>
			&nbsp;<br>
			Um TIPP10 unter Mac OS zu starten, navigieren Sie &uuml;ber den <i>Finder</i> in das Verzeichnis <i>Programme</i> und f&uuml;hren Sie einen Doppelklick auf die Datei <i>TIPP10</i> aus.<br>
			&nbsp;<br>
			F&uuml;r den Start von TIPP10 unter Linux, navigieren Sie &uuml;ber das Terminal (die Konsole) in das Verzeichnis, in das Sie TIPP10 entpackt haben, und starten dann die Datei <i>tipp10</i>. Bei einer grafischen Oberfl&auml;che (z.B. KDE) sollten Sie die Datei auch mit der Maus starten k&ouml;nnen. Bei (K)Ubuntu k&ouml;nnen Sie dies &uuml;ber das Startmenu und die Eintr&auml;ge <i>Anwendungen</i> - <i>Bildung</i> - <i>TIPP10</i> tun.<br>
			&nbsp;<br>
			Nach dem Programmstart wird Ihnen zuerst ein Einf&uuml;hrungsfenster angezeigt. Wenn dieses Fenster bei zuk&uuml;nftigen Programmstarts nicht mehr angezeigt werden soll, k&ouml;nnen Sie den Haken bei <i>Dieses Fenster nicht mehr anzeigen</i> setzen. Um die Einf&uuml;hrung zu beenden und die TIPP10-Oberfl&auml;che zu starten, klicken Sie auf den Button <i>TIPP10 starten</i>.<br>
			&nbsp;
		</p>
		<p class="small">
			<img src="../img/arrow_left.png" width="10" height="10" border="0">&nbsp;<a href="behaviour.html">Ergonomie am Arbeitsplatz</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="../index.html">Inhaltsverzeichnis</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="lessons.html">Schreibtraining</a>&nbsp;<img src="../img/arrow_right.png" width="10" height="10" border="0">
		</p>
		<p class="small">
			&copy; 2006-2011 Tom Thielicke IT Solutions
		</p>
	  </div>
	</body>
</html>